[1,0,0,[["cc.TextAsset",["_name","text"],1]],[[0,0,1,3]],[[0,"privacy_policy","隐私政策\n引言欢迎使用我们的应用程序（以下简称 “本应用”）。我们高度重视用户隐私和个人信息安全。本隐私政策旨在清晰地告知您我们如何收集、使用、存储和保护您的个人信息，以及您所拥有的权利和如何行使这些权利。本政策依据相关法律法规制定，包括《中华人民共和国个人信息保护法》、《中华人民共和国网络安全法》、《通用数据保护条例》（GDPR）以及《加州消费者隐私法案》（CCPA）。使用本应用即表示您已阅读、理解并同意本政策的所有条款；如您不同意，请不要使用本应用。\n定义与适用范围\n个人信息：指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息，包括但不限于姓名、联系方式、位置信息、设备信息和浏览历史。\n敏感个人信息：指一旦泄露、非法提供或者滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或者歧视性待遇等的个人信息，包括生物识别信息、健康信息、精准位置信息、支付账户信息。\n适用范围：本政策适用于本应用及相关服务的所有用户，包括注册用户和非注册用户；不适用于通过本应用提供的第三方服务（如第三方 SDK、链接的网站 / 应用），其隐私政策由第三方独立制定。\n数据的收集与使用\n3.1 收集的信息类型\n用户主动提供的信息：\n注册信息：注册账户时提交的基本信息，如姓名、电话号码、电子邮箱地址和头像；\n功能相关信息：使用支付功能时提供的信息（例如银行卡号、支付账户详情）和使用社交功能时上传的内容（例如照片、视频）；\n反馈信息：通过客服、调查问卷或其他渠道提交的投诉、建议或其他沟通内容。\n自动收集的信息：\n设备信息：例如设备型号、操作系统版本、设备标识符（Device ID）、IP 地址和浏览器类型；\n使用行为信息：例如应用浏览历史、功能使用频率、点击路径和停留时长；\n位置信息：如果您开启了位置权限，我们可能会收集您的大致或精准位置（仅用于提供相应服务，如导航或附近推荐）；\n技术数据：通过 Cookies、日志文件和网络信标（Web Beacons）等跟踪技术收集的匿名数据（用于优化服务体验；您可以在设备设置中禁用非必要的 Cookies）。\n3.2 收集与使用目的我们严格遵循 “目的明确” 和 “最小必要” 原则，仅为以下合法目的收集和使用您的信息：\n提供基本服务：如账户登录、功能操作、交易结算和客服响应；\n优化用户体验：分析使用行为数据以改进应用性能、修复漏洞和优化界面设计；\n个性化服务：基于您的偏好提供定制化的内容推荐和广告推送（您可在设置中禁用此项）；\n安全保障：识别和防范欺诈、恶意攻击等安全风险，保护用户合法权益；\n合规要求：响应法院传票、司法调查等法定义务，或保护公共利益。\n3.3 同意机制\n本应用首次启动时，我们将通过弹窗明确告知您信息收集的范围和目的；您点击 “同意” 即构成授权；\n对于敏感个人信息（如精准位置、生物识别数据），我们将通过弹窗单独请求您的明示同意。您可以自主选择授权或拒绝，拒绝不会影响基本功能的使用；\n您可以随时通过应用内的 “设置 - 隐私中心” 撤回或修改授权权限。\n数据共享、转让与公开披露\n4.1 数据共享\n原则上，我们不会与第三方共享您的个人信息，除非发生以下情形：\n获得您的明确书面同意；\n与关联公司共享：仅用于提供协同服务（如账户互通、客服联动），且关联公司将遵守本隐私政策的保护要求；\n与第三方服务提供商共享：如地图服务提供商（共享位置信息以提供导航）、支付机构（共享交易信息以完成结算）、安全测试机构（共享必要数据以防范风险）。我们会对第三方进行合规评估，并要求其采取同等的安全保护措施；\n去标识化共享：与广告和分析服务提供商共享已去除个人标识的匿名化数据，该数据无法还原为可识别的个人信息。\n4.2 数据转让您的个人信息仅在以下特殊情况下可能发生转让：\n获得您的明确同意；\n因公司合并、收购、破产清算等资产转移情形，我们将提前 30 天通知您，且受让方将继续履行数据保护义务。\n4.3 数据公开披露您的个人信息仅在以下合法情况下会被公开披露：\n响应法律法规和行政法规的强制性要求（如司法调查、政府监管）；\n保护用户的生命财产安全、公共利益或他人合法权益；\n您发生严重违约行为时，为维权向守约方披露。\n数据存储与安全\n5.1 存储期限与地点\n存储期限：我们仅在实现收集目的所必需的合理期限内存储您的个人信息。服务终止或存储期限届满后，数据将被自动删除或匿名化处理（法律另有规定的除外）；\n存储地点：中国大陆用户的数据将存储在位于中国大陆的服务器上；如涉及跨境存储（例如针对欧盟用户），我们将遵守 GDPR 的跨境数据传输规则，确保数据安全。\n5.2 安全保护措施\n技术措施：采用数据加密（传输加密、存储加密）、访问控制、防火墙、入侵检测等技术手段，防止数据泄露和篡改；\n管理措施：建立分级权限管理制度，限制员工对数据的访问，并定期开展数据保护培训；\n应急响应：制定数据泄露应急预案。发生安全事件时，我们将在 72 小时内通知受影响用户，采取补救措施，并向监管机构报告。\n用户权利\n根据法律规定，您享有以下与个人信息相关的权利，可通过 “设置 - 隐私中心” 或联系客服行使：\n知情权：有权查询您个人信息的收集、使用、存储和共享的具体情况；\n访问与更正权：有权获取您个人信息的副本或要求更正不准确、不完整的信息；\n删除权（被遗忘权）：有权要求删除您的个人信息（例如账户注销、数据不再必要时）。我们将在 15 个工作日内完成处理（法律另有规定的除外）；\n撤回同意权：有权随时撤回授权。撤回后，将不再收集新数据，但不影响基于先前同意对数据的合法处理；\n反对权：有权反对自动化决策（如个性化推荐），可通过设置禁用，且不限制基本服务；\n投诉权：如您认为数据处理活动侵犯了您的权益，可通过本政策预留的渠道投诉，我们将在 10 个工作日内响应处理。\n隐私政策的更新\n我们可能会根据法律法规更新或业务调整修订本政策。修订后，我们将通过应用弹窗、公告、邮件或其他方式通知您；\n若更新内容涉及您权益的重大变更（如扩大数据收集范围、变更共享规则），我们将通过弹窗单独提示您确认同意。在您确认前，原政策继续有效；\n您可在应用内 “关于 - 隐私政策” 查看历史版本。更新后的政策自通知之日起生效。\n联系方式\n如您对本隐私政策有任何疑问、投诉，或需要行使相关权利，可通过以下渠道联系我们：\n联系邮箱：[隐私专用邮箱地址]\n联系电话：[隐私咨询电话号码]\n联系地址：[公司注册地址]\n在线客服：应用内 “我的 - 客服中心”\n其他条款\n本政策受中华人民共和国法律管辖（对于中国境外用户，将增加对应地区适用法律的条款，如 GDPR 和 CCPA）；\n因本政策引起的争议，首先应通过协商解决；协商不成的，应提交 [仲裁机构] 仲裁或向有管辖权的人民法院提起诉讼；\n本政策未尽事宜，将依据相关法律法规处理。"]],0,0,[],[],[]]
