[1,["7dj5uJT9FMn6OrOOx83tfK@f9941","37EtQhCsxFt5/JVP6zmK8z@f9941","efbY3eX5ZMXpl+JPA/QiIc@f9941","660WQ9PpBJ3pQ1wNVuaQ+j@f9941","5bpPL+FcJJmpX+m534dDyV","b9GoaqhetAoLub1rk7BMmk","c5RfgSdjpLCrmUYubBJhHn","f1Jtv2RP9Gr7wp4ulGrnyA"],["node","_spriteFrame","_target","_parent","root","data","txtPrivacyPolicy","txtTermsCondition","txtPrivacyPolicyZh","txtTermsConditionZh"],[["cc.Node",["_name","_layer","_components","_prefab","_children","_parent","_lpos"],1,9,4,2,1,5],["cc.Label",["_string","_actualFontSize","_fontSize","_overflow","_lineHeight","_isUnderline","node","__prefab","_color"],-3,1,4,5],["cc.Sprite",["_sizeMode","_type","node","__prefab","_spriteFrame","_color"],1,1,4,6,5],["cc.UITransform",["node","__prefab","_contentSize"],3,1,4,5],["cc.Layout",["_resizeMode","_layoutType","_spacingX","node","__prefab"],0,1,4],["cc.Widget",["_alignFlags","_originalWidth","_originalHeight","_left","_bottom","node","__prefab"],-2,1,4],["cc.Button",["_transition","node","__prefab","clickEvents","_target"],2,1,4,9,1],["cc.TextAsset",["_name","text"],1],["cc.Prefab",["_name"],2],["cc.CompPrefabInfo",["fileId"],2],["26e17MkgrFDdId2dZlUDugY",["node","__prefab"],3,1,4],["cc.PrefabInfo",["fileId","instance","targetOverrides","nestedPrefabInstanceRoots","root","asset"],-1,1,1],["8d1287GlERPIo30TYtiKAKt",["node","__prefab","txtPrivacyPolicy","txtTermsCondition","txtPrivacyPolicyZh","txtTermsConditionZh"],3,1,4,6,6,6,6],["cc.UIOpacity",["node","__prefab"],3,1,4],["cc.ClickEvent",["_componentId","handler","target"],1,1],["edf98QH2D1AUoCrtQlbxFrU",["key","node","__prefab"],2,1,4],["cc.BlockInputEvents",["node","__prefab"],3,1,4]],[[9,0,2],[11,0,1,2,3,4,5,5],[3,0,1,2,1],[0,0,1,5,2,3,6,3],[15,0,1,2,2],[7,0,1,3],[0,0,1,5,2,3,3],[14,0,1,2,3],[0,0,1,4,2,3,3],[0,0,1,5,4,2,3,6,3],[4,3,4,1],[4,0,1,2,3,4,4],[5,0,1,2,5,6,4],[1,0,1,2,5,6,7,8,5],[6,0,1,2,3,4,2],[2,0,2,3,4,2],[8,0,2],[0,0,1,4,2,3,6,3],[0,0,1,5,4,2,3,3],[3,0,1,1],[5,0,3,4,5,6,4],[10,0,1,1],[12,0,1,2,3,4,5,1],[13,0,1,1],[1,0,1,2,3,6,7,8,5],[1,0,1,2,4,3,6,7,8,6],[1,0,1,2,4,6,7,5],[1,0,1,2,6,7,8,4],[6,0,1,2,3,2],[2,0,2,3,5,4,2],[2,1,0,2,3,4,3],[16,0,1,1]],[[[[5,"PrivacyPolicy","**Privacy Policy**\n\nPopCandy.cc built the PopCandy app as [open source/free/freemium/ad-supported/commercial] app. This SERVICE is provided by PopCandy.cc at no cost and is intended for use as is.\n\nThis page is used to inform visitors regarding our policies with the collection, use, and disclosure of Personal Information if anyone decided to use our Service.\n\nIf you choose to use our Service, then you agree to the collection and use of information in relation to this policy. The Personal Information that we collect is used for providing and improving the Service. We will not use or share your information with anyone except as described in this Privacy Policy.\n\nThe terms used in this Privacy Policy have the same meanings as in our Terms and Conditions, which are accessible at PopCandy unless otherwise defined in this Privacy Policy.\n\n**Information Collection and Use**\n\nFor a better experience, while using our Service, we may require you to provide us with certain personally identifiable information. The information that we request will be retained by us and used as described in this privacy policy.\n\nThe app does use third-party services that may collect information used to identify you.\n\nLink to the privacy policy of third-party service providers used by the app\n\n*   [AdMob](https://support.google.com/admob/answer/6128543?hl=en)\n*   [Google Analytics for Firebase](https://firebase.google.com/policies/analytics)\n\n**Log Data**\n\nWe want to inform you that whenever you use our Service, in a case of an error in the app we collect data and information (through third-party products) on your phone called Log Data. This Log Data may include information such as your device Internet Protocol (“IP”) address, device name, operating system version, the configuration of the app when utilizing our Service, the time and date of your use of the Service, and other statistics.\n\n**Cookies**\n\nCookies are files with a small amount of data that are commonly used as anonymous unique identifiers. These are sent to your browser from the websites that you visit and are stored on your device's internal memory.\n\nThis Service does not use these “cookies” explicitly. However, the app may use third-party code and libraries that use “cookies” to collect information and improve their services. You have the option to either accept or refuse these cookies and know when a cookie is being sent to your device. If you choose to refuse our cookies, you may not be able to use some portions of this Service.\n\n**Service Providers**\n\nWe may employ third-party companies and individuals due to the following reasons:\n\n*   To facilitate our Service;\n*   To provide the Service on our behalf;\n*   To perform Service-related services; or\n*   To assist us in analyzing how our Service is used.\n\nWe want to inform users of this Service that these third parties have access to their Personal Information. The reason is to perform the tasks assigned to them on our behalf. However, they are obligated not to disclose or use the information for any other purpose.\n\n**Security**\n\nWe value your trust in providing us your Personal Information, thus we are striving to use commercially acceptable means of protecting it. But remember that no method of transmission over the internet, or method of electronic storage is 100% secure and reliable, and we cannot guarantee its absolute security.\n\n**Links to Other Sites**\n\nThis Service may contain links to other sites. If you click on a third-party link, you will be directed to that site. Note that these external sites are not operated by us. Therefore, we strongly advise you to review the Privacy Policy of these websites. We have no control over and assume no responsibility for the content, privacy policies, or practices of any third-party sites or services.\n\n**Children’s Privacy**\n\nThese Services do not address anyone under the age of 13. We do not knowingly collect personally identifiable information from children under 13 years of age. In the case we discover that a child under 13 has provided us with personal information, we immediately delete this from our servers. If you are a parent or guardian and you are aware that your child has provided us with personal information, please contact us so that we will be able to do the necessary actions.\n\n**Changes to This Privacy Policy**\n\nWe may update our Privacy Policy from time to time. Thus, you are advised to review this page periodically for any changes. We will notify you of any changes by posting the new Privacy Policy on this page.\n\nThis policy is effective as of 2021-12-01\n\n**Contact Us**\n\nIf you have any questions or suggestions about our Privacy Policy, do not hesitate to contact us at support@popcandy.cc."]],0,0,[],[],[]],[[[16,"AppPrivacyDialogUI"],[8,"AppPrivacyDialogUI",33554432,[-6,-7],[[2,-2,[0,"3chgxEWLBClZvQbRvXRPws"],[5,640,960.0000000000001]],[10,-3,[0,"25UpfpIs5Ab7HlNK9TBu6A"]],[12,45,100,100,-4,[0,"da+v5vdoRDd7VuATHW3EkI"]],[21,-5,[0,"1cmeTJoO5LV6oxWhQP24f2"]]],[1,"2frTeuxKVMyZ6hNFnS6rHr",null,null,null,-1,0]],[17,"AppPrivacyPolicy",33554432,[-12,-13,-14],[[2,-8,[0,"23+644785AI4++T0WdhTDy"],[5,200,60]],[11,1,1,10,-9,[0,"83ELDDmdRGsK7MLh3LRVm1"]],[20,4,2.7060000000000173,135.095,-10,[0,"aanX9gatNA0YFwq3oF5+zd"]],[22,-11,[0,"cfPg6WlchGcIH4tIGBVGgE"],4,5,6,7]],[1,"49laJ5kShDRrScZqCCLCt8",null,null,null,1,0],[1,0,-59.905,0]],[18,"Panel",33554432,1,[-17,-18,-19,-20,2],[[2,-15,[0,"f7NISe7HdAD68SLfhnddy8"],[5,450,450]],[23,-16,[0,"0bVqkdNGJDlY9F7VifPcoT"]]],[1,"caR+8KK9tNBJ1Gax3yNSqS",null,null,null,1,0]],[3,"LabelPrivacyPolicy",33554432,2,[[2,-21,[0,"1aqXbJsUFMXaB+wAayWelr"],[5,80,50.4]],[13,"隐私政策",26.75,20,true,-22,[0,"afmyT6FphOFo58MuAGmBqk"],[4,4294922752]],[14,3,-24,[0,"28VuUmB7hMBJze5B5UJtwq"],[[7,"8d1287GlERPIo30TYtiKAKt","onPrivacyPolicyClick",2]],-23],[4,"privacyPolicy",-25,[0,"599fw6ZTNG7aBw4rmpmfCD"]]],[1,"fade0BaftArISKkZEIWB0g",null,null,null,1,0],[1,-60,0,0]],[3,"LabelTermsConditions",33554432,2,[[2,-26,[0,"3fFv/7+QlHtoC9YlC5e+zZ"],[5,80,50.4]],[13,"条款声明",26.75,20,true,-27,[0,"3cWY7dGgVP26PlHvt7MUL4"],[4,4294922752]],[14,3,-29,[0,"448/wsTatM+424n7ZSfu5x"],[[7,"8d1287GlERPIo30TYtiKAKt","onTermsConditionClick",2]],-28],[4,"termsAndConditions",-30,[0,"fdBM6YNmhL5ZNCUEPAo0oY"]]],[1,"dfomBe86tO3p53fG9+daid",null,null,null,1,0],[1,60,0,0]],[6,"Bg",33554432,1,[[2,-31,[0,"1d6CE1TodLs6IXXPCrJRlh"],[5,640,960.0000000000001]],[29,0,-32,[0,"f8UXxOMrZE9YxpnEpNim6Y"],[4,2852126720],0],[12,45,100,100,-33,[0,"abZ5BcSMlKb7TRAvx1A5qj"]],[31,-34,[0,"7e8ERz+85J2rqBgAaM7Xhl"]]],[1,"f4szo8v35CSqBBcNpuhvIh",null,null,null,1,0]],[9,"Header",33554432,3,[-37,-38],[[19,-35,[0,"b4YOTfYKpOTL5iK/jxjq9X"]],[10,-36,[0,"8fYJVftkJGbrAGVpY8dD51"]]],[1,"adHkt17U9L0In1zq+FyX/j",null,null,null,1,0],[1,0,176.267,0]],[8,"ButtonOK",33554432,[-42],[[2,-39,[0,"f7NISe7HdAD68SLfhnddy8"],[5,200,88]],[15,0,-40,[0,"e71ctEmpxFC4KlSYRZNz/a"],3],[28,3,-41,[0,"6fWNIHfs5GuJYNY8Ttxq/x"],[[7,"26e17MkgrFDdId2dZlUDugY","onAcceptClick",1]]]],[1,"73Zm4eNZVBCItNVj5/pnzv",null,null,null,1,0]],[3,"LabelTitle",33554432,7,[[2,-43,[0,"c68UOAlNhN171Umca6yVvF"],[5,320,50.4]],[24,"欢迎",35,26,2,-44,[0,"2frm37uaJHQr0AEEaYyM82"],[4,4292904900]],[4,"welcome",-45,[0,"41pvXw9ZBM8LFNOG0Pgbo/"]]],[1,"5bZT4IJX5J5qlYM/j4VT9+",null,null,null,1,0],[1,0,32.269,0]],[3,"LabelContent",33554432,3,[[2,-46,[0,"c68UOAlNhN171Umca6yVvF"],[5,360,160]],[25,"在游戏之前,\n请先阅读以下内容:",38,28,36,2,-47,[0,"2frm37uaJHQr0AEEaYyM82"],[4,4294966183]],[4,"privacyMessage",-48,[0,"9e8cIPJaJIDLEvHYAQT9mm"]]],[1,"40ifyY/W1DA77i+Ts8wBN9",null,null,null,1,0],[1,0,36.904,0]],[9,"LayoutButtons",33554432,3,[8],[[2,-49,[0,"88mqjMz+9NW7XrE2jQE1ou"],[5,200,100]],[11,1,1,25,-50,[0,"98O7BqB+1CMbvzPolwfAkG"]]],[1,"d67qEoSDZDGaBS91WgL2fy",null,null,null,1,0],[1,0,-166.28,0]],[3,"Label",33554432,8,[[2,-51,[0,"c68UOAlNhN171Umca6yVvF"],[5,55.999995436623834,62.99999999999999]],[26,"同意",37.449999999999996,28,50,-52,[0,"2frm37uaJHQr0AEEaYyM82"]],[4,"accept",-53,[0,"d5MYcaCw5M+4wTV5Kht66a"]]],[1,"f63HoxqMpKLKO+TYUY0KG5",null,null,null,1,0],[1,0,4,0]],[6,"Label",33554432,2,[[2,-54,[0,"37GMmtt39AF7CTaPUbDatS"],[5,20,50.4]],[27,"和",26.75,20,-55,[0,"53lJyyC35DGb7UZVQ7agRu"],[4,4294966183]],[4,"and",-56,[0,"b1uvLL3l1MP6ShXPfupwVn"]]],[1,"8a4NoRH09Ie7THGIDlpWKn",null,null,null,1,0]],[6,"Bg",33554432,3,[[2,-57,[0,"f7NISe7HdAD68SLfhnddy8"],[5,450,450]],[30,1,0,-58,[0,"e71ctEmpxFC4KlSYRZNz/a"],1]],[1,"2ebMl3BV1NcoSHdtcV4alv",null,null,null,1,0]],[3,"rect",33554432,7,[[2,-59,[0,"f7NISe7HdAD68SLfhnddy8"],[5,450,120]],[15,0,-60,[0,"e71ctEmpxFC4KlSYRZNz/a"],2]],[1,"e62vxacGVNg7qAejeSvbUM",null,null,null,1,0],[1,0,20,0]]],0,[0,4,1,0,0,1,0,0,1,0,0,1,0,0,1,0,-1,6,0,-2,3,0,0,2,0,0,2,0,0,2,0,0,2,0,-1,4,0,-2,13,0,-3,5,0,0,3,0,0,3,0,-1,14,0,-2,7,0,-3,10,0,-4,11,0,0,4,0,0,4,0,2,4,0,0,4,0,0,4,0,0,5,0,0,5,0,2,5,0,0,5,0,0,5,0,0,6,0,0,6,0,0,6,0,0,6,0,0,7,0,0,7,0,-1,15,0,-2,9,0,0,8,0,0,8,0,0,8,0,-1,12,0,0,9,0,0,9,0,0,9,0,0,10,0,0,10,0,0,10,0,0,11,0,0,11,0,0,12,0,0,12,0,0,12,0,0,13,0,0,13,0,0,13,0,0,14,0,0,14,0,0,15,0,0,15,0,5,1,2,3,3,8,3,11,60],[0,0,0,0,0,0,0,0],[1,1,1,1,6,7,8,9],[0,1,2,3,4,5,6,7]],[[[5,"TermsConditions","**Terms & Conditions**\n\nBy downloading or using the app, these terms will automatically apply to you – you should make sure therefore that you read them carefully before using the app. You’re not allowed to copy or modify the app, any part of the app, or our trademarks in any way. You’re not allowed to attempt to extract the source code of the app, and you also shouldn’t try to translate the app into other languages or make derivative versions. The app itself, and all the trademarks, copyright, database rights, and other intellectual property rights related to it, still belong to PopCandy.cc.\n\nZeeyogo is committed to ensuring that the app is as useful and efficient as possible. For that reason, we reserve the right to make changes to the app or to charge for its services, at any time and for any reason. We will never charge you for the app or its services without making it very clear to you exactly what you’re paying for.\n\nThe PopCandy app stores and processes personal data that you have provided to us, to provide our Service. It’s your responsibility to keep your phone and access to the app secure. We therefore recommend that you do not jailbreak or root your phone, which is the process of removing software restrictions and limitations imposed by the official operating system of your device. It could make your phone vulnerable to malware/viruses/malicious programs, compromise your phone’s security features and it could mean that the PopCandy app won’t work properly or at all.\n\nThe app does use third-party services that declare their Terms and Conditions.\n\nLink to Terms and Conditions of third-party service providers used by the app\n\n*   [AdMob](https://developers.google.com/admob/terms)\n*   [Google Analytics for Firebase](https://firebase.google.com/terms/analytics)\n\nYou should be aware that there are certain things that Zeeyogo will not take responsibility for. Certain functions of the app will require the app to have an active internet connection. The connection can be Wi-Fi or provided by your mobile network provider, but Zeeyogo cannot take responsibility for the app not working at full functionality if you don’t have access to Wi-Fi, and you don’t have any of your data allowance left.\n\nIf you’re using the app outside of an area with Wi-Fi, you should remember that the terms of the agreement with your mobile network provider will still apply. As a result, you may be charged by your mobile provider for the cost of data for the duration of the connection while accessing the app, or other third-party charges. In using the app, you’re accepting responsibility for any such charges, including roaming data charges if you use the app outside of your home territory (i.e. region or country) without turning off data roaming. If you are not the bill payer for the device on which you’re using the app, please be aware that we assume that you have received permission from the bill payer for using the app.\n\nAlong the same lines, Zeeyogo cannot always take responsibility for the way you use the app i.e. You need to make sure that your device stays charged – if it runs out of battery and you can’t turn it on to avail the Service, Zeeyogo cannot accept responsibility.\n\nWith respect to zeeyogo’s responsibility for your use of the app, when you’re using the app, it’s important to bear in mind that although we endeavor to ensure that it is updated and correct at all times, we do rely on third parties to provide information to us so that we can make it available to you. Zeeyogo accepts no liability for any loss, direct or indirect, you experience as a result of relying wholly on this functionality of the app.\n\nAt some point, we may wish to update the app. The app is currently available on iOS – the requirements for the system(and for any additional systems we decide to extend the availability of the app to) may change, and you’ll need to download the updates if you want to keep using the app. Zeeyogo does not promise that it will always update the app so that it is relevant to you and/or works with the iOS version that you have installed on your device. However, you promise to always accept updates to the application when offered to you, We may also wish to stop providing the app, and may terminate use of it at any time without giving notice of termination to you. Unless we tell you otherwise, upon any termination, (a) the rights and licenses granted to you in these terms will end; (b) you must stop using the app, and (if needed) delete it from your device.\n\n**Changes to This Terms and Conditions**\n\nWe may update our Terms and Conditions from time to time. Thus, you are advised to review this page periodically for any changes. We will notify you of any changes by posting the new Terms and Conditions on this page.\n\nThese terms and conditions are effective as of 2021-12-01\n\n**Contact Us**\n\nIf you have any questions or suggestions about our Terms and Conditions, do not hesitate to contact us at support@popcandy.cc."]],0,0,[],[],[]],[[[5,"PrivacyPolicy_zh","PopCandy.cc将PopCandy应用程序构建为[开源/免费/免费增值/广告支持/商业]应用程序。这项服务由PopCandy提供。Cc免费，并打算按原样使用。\n\n如果有人决定使用我们的服务，此页面用于通知访问者有关我们收集、使用和披露个人信息的政策。\n\n如果您选择使用我们的服务，即表示您同意收集和使用与本政策相关的信息。我们收集的个人信息用于提供和改进本服务。除本隐私政策所述外，我们不会与任何人使用或分享您的信息。\n\n本隐私政策中使用的术语与我们的条款和条件含义相同，除非本隐私政策中另有定义，否则可在PopCandy访问这些条款和条件。\n\n**信息收集和使用**\n\n为了获得更好的体验，在使用我们的服务时，我们可能会要求您向我们提供某些个人身份信息。我们所要求的信息将由我们保留，并按照本隐私政策的规定使用。\n\n该应用程序确实使用第三方服务，这些服务可能会收集用于识别您的信息。\n\n链接到应用程序使用的第三方服务提供商的隐私政策\n\n* (AdMob) (https://support.google.com/admob/answer/6128543?hl=en)\n* [Google Analytics for Firebase](https://firebase.google.com/policies/analytics)\n\n* * * *日志数据\n\n我们想通知您，每当您使用我们的服务时，如果应用程序出现错误，我们会(通过第三方产品)收集您手机上的数据和信息，称为日志数据。此日志数据可能包括您的设备互联网协议(“IP”)地址、设备名称、操作系统版本、使用我们服务时的应用程序配置、您使用本服务的时间和日期以及其他统计信息。\n\n* * * *饼干\n\ncookie是包含少量数据的文件，通常用作匿名唯一标识符。这些信息从你访问的网站发送到你的浏览器，并存储在你设备的内部存储器中。\n\n本服务不会明确使用这些“cookie”。但是，应用程序可能会使用使用“cookie”的第三方代码和库来收集信息并改进其服务。您可以选择接受或拒绝这些cookie，并知道何时将cookie发送到您的设备。如果您选择拒绝我们的cookies，您可能无法使用本服务的某些部分。\n\n* * * *服务提供者\n\n出于以下原因，我们可能会聘请第三方公司和个人:\n\n*方便我们的服务;\n*代表我们提供服务;\n*执行与服务有关的服务;或\n*协助我们分析我们的服务如何被使用。\n\n我们希望通知本服务的用户，这些第三方有权访问他们的个人信息。原因是代表我们执行分配给他们的任务。但是，他们有义务不将这些信息披露或用于任何其他目的。\n\n* * * *安全\n\n我们重视您对我们提供您的个人信息的信任，因此我们正在努力使用商业上可接受的方式来保护您的个人信息。但请记住，没有任何通过互联网传输的方法，或电子存储的方法是100%安全可靠的，我们不能保证它的绝对安全。\n\n**链接到其他网站**\n\n本服务可能包含指向其他网站的链接。如果你点击第三方链接，你将被引导到该网站。请注意，这些外部网站并非由我们运营。因此，我们强烈建议您查看这些网站的隐私政策。我们无法控制任何第三方网站或服务的内容、隐私政策或做法，也不承担任何责任。\n\n* * * *孩子的隐私\n\n这些服务不针对13岁以下的任何人。我们不会故意收集13岁以下儿童的个人身份信息。如果我们发现13岁以下的儿童向我们提供了个人信息，我们会立即从我们的服务器上删除该信息。如果您是家长或监护人，并且您知道您的孩子向我们提供了个人信息，请与我们联系，以便我们能够采取必要的行动。\n\n**本隐私政策的变更**\n\n我们可能会不时更新我们的隐私政策。因此，建议您定期查看此页面的任何更改。如有任何更改，我们将在本页公布新的隐私政策。\n\n本政策自2021年12月1日起生效\n\n* * * *联系我们\n\n如果您对我们的隐私政策有任何疑问或建议，请通过support@popcandy.cc与我们联系。"]],0,0,[],[],[]],[[[5,"TermsConditions_zh","**条款与条件**\n\n通过下载或使用应用程序，这些条款将自动适用于您-因此，您应该确保在使用应用程序之前仔细阅读它们。您不允许以任何方式复制或修改应用程序，应用程序的任何部分或我们的商标。你不允许尝试提取应用程序的源代码，你也不应该尝试将应用程序翻译成其他语言或制作衍生版本。这款应用本身以及与之相关的所有商标、版权、数据库权利和其他知识产权仍然属于PopCandy.cc。\n\npopcandy.cc致力于确保应用程序尽可能有用和高效。因此，我们保留在任何时候以任何理由对应用程序进行更改或对其服务收费的权利。如果你不清楚你在为什么付费，我们永远不会向你收取应用程序或其服务的费用。\n\nPopCandy应用程序存储并处理您提供给我们的个人数据，以提供我们的服务。你有责任保护你的手机和访问应用程序的安全。因此，我们建议您不要越狱或root您的手机，这是消除软件限制和限制的过程，由您的设备的官方操作系统。它可能会使你的手机容易受到恶意软件/病毒/恶意程序的攻击，损害你手机的安全功能，这可能意味着PopCandy应用程序将无法正常工作或根本无法工作。\n\n该应用确实使用了第三方服务，并声明了他们的条款和条件。\n\n链接到应用程序使用的第三方服务提供商的条款和条件\n\n* (AdMob) (https://developers.google.com/admob/terms)\n* [Google Analytics for Firebase](https://firebase.google.com/terms/analytics)\n\n你应该知道，有些事情是芝友不承担责任的。该应用程序的某些功能需要应用程序具有活跃的互联网连接。连接可以是Wi-Fi，也可以是你的移动网络提供商提供的，但如果你没有Wi-Fi连接，而且你的数据流量额度已经所剩无多，那么popcandy.cc不承担任何责任。\n\n如果你是在有Wi-Fi的地区以外使用这款应用，你应该记住，你与移动网络提供商的协议条款仍然适用。因此，您的移动运营商可能会向您收取访问应用程序期间连接期间的数据费用，或其他第三方费用。在使用该应用程序时，您将承担任何此类费用，包括如果您在未关闭数据漫游的情况下在您的本国领土(即地区或国家)以外使用该应用程序的漫游数据费用。如果您不是使用该应用程序的设备的付款人，请注意，我们假设您已经获得了使用该应用程序的付款人的许可。\n\n同样的道理，popcandy.cc不能总是对你使用应用程序的方式负责，也就是说，你需要确保你的设备保持充电——如果电池耗尽，你不能打开它来使用服务，popcandy.cc不能承担责任。\n\n关于popcandy.cc对您使用该应用程序的责任，当您使用该应用程序时，重要的是要记住，尽管我们努力确保它始终是更新和正确的，但我们确实依赖第三方向我们提供信息，以便我们可以将其提供给您。popcandy.cc不承担任何损失，直接或间接，你所经历的完全依赖于应用程序的这个功能的结果。\n\n在某种程度上,我们可能希望更新iOS应用。目前市面上的应用,对系统需求的(和任何额外的系统我们决定扩展应用程序的可用性)可能改变,你需要下载更新应用程序。如果你想继续使用popcandy.cc并不保证它总是更新应用程序是有关你和/或使用iOS版本,安装在你的设备上。但是，您承诺在向您提供应用程序时始终接受更新，我们也可能希望停止提供应用程序，并可能随时终止使用，而不会向您发出终止通知。除非我方另有通知，在任何终止后，(a)本条款中授予您的权利和许可将终止;(b)您必须停止使用该应用程序，并(如果需要)将其从您的设备中删除。\n\n**本条款和条件的变更**\n\n我们可能会不时更新我们的条款和条件。因此，建议您定期查看此页面的任何更改。如有任何更改，我们将在本页公布新的条款和条件。\n\n这些条款和条件自2021年12月1日起生效\n\n* * * *联系我们\n\n如果您对我们的条款和条件有任何疑问或建议，请不要犹豫，通过support@popcandy.cc与我们联系。\n "]],0,0,[],[],[]]]]
